<a href="https://colab.research.google.com/github/Saeswar/AI-ML-AVANTHI-SAESWAR/blob/main/Untitled1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Fundamental Python Programming

Q1. Write a Python function that takes in a list of integers and returns the sum of all elements at even indices (0-based indexing) in the list. For example, for the input list [1, 2, 3, 4, 5, 6], the function should return 9 (which is the sum of elements at indices 0, 2, and 4).

In [1]:
def sum_even_indices(lst):
    return sum(lst[::2])
my_list = [1, 2, 3, 4, 5, 6]
result = sum_even_indices(my_list)
print(result)

9

Q2. Write a Python function that takes a list of strings as input and returns a new list containing only the strings that have a length greater than 3 characters and start with the letter 'A'. The output list should be sorted alphabetically. For example, given the input ["Apple", "Banana", "Ant", "Art", "Cat"], the function should return ["Apple", "Art"].

In [2]:
def filter_and_sort_strings(input_list):
    result_list = [string for string in input_list if len(string) > 3 and string[0].lower() == 'a']
    result_list.sort()
    return result_list
input_strings = ["Apple", "Banana", "Ant", "Art", "Cat"]
output_result = filter_and_sort_strings(input_strings)
print(output_result)

['Apple']

Q3. Create a Python function that takes in two lists of equal length containing integers. The function should return a new list where each element is the sum of the corresponding elements from the input lists. If the lists are a = [1, 2, 3] and b = [4, 5, 6], the function should return [5, 7, 9].

In [3]:
def add_corresponding_elements(list_a, list_b):
    result = [a + b for a, b in zip(list_a, list_b)]
    return result
list_a = [1, 2, 3]
list_b = [4, 5, 6]
result_list = add_corresponding_elements(list_a, list_b)
print(result_list)

[5, 7, 9]

Q4. Write a program which will find all such numbers which are divisible by 7 but are not a multiple of 5, between 2000 and 3200 (both included). The numbers obtained should be printed in a comma-separated sequence on a single line.

Q5. With a given integral number n, write a program to generate a dictionary that contains (i, i*i) such that is an integral number between 1 and n (both included). and then the program should print the dictionary. Suppose the following input is supplied to the program: 8 Then, the output should be: {1: 1, 2: 4, 3: 9, 4: 16, 5: 25, 6: 36, 7: 49, 8: 64}

Numpy Practice Questions

Q1. Given two NumPy arrays arr1 = np.array([1, 2, 3]) and arr2 = np.array([4, 5, 6]), perform element-wise addition.

In [5]:
import numpy as np
arr1 = np.array([1, 2, 3])
arr2 = np.array([4, 5, 6])
result = arr1 + arr2
print(result)

[5 7 9]

Q2. Access and print the element at the second row and third column of a given 2D NumPy array arr.

In [8]:
# Take the array to be: [[1,2,3,4,5], [4,2,7,8], [6,2,9,1,0]]

Q3. Reshape a given 1D array arr of size 10 into a 2D array of shape (5, 2).

In [10]:
 #Take the array as: [1,2,3,4,5,6,7,8,9,10]
original_array = np.array([1,2,3,4,5,6,7,8,9,10])
reshaped_array = original_array.reshape((5,2))
print(reshaped_array)

[[ 1  2]
 [ 3  4]
 [ 5  6]
 [ 7  8]
 [ 9 10]]

Q4. Extract the first three elements from a given NumPy array arr.

In [11]:
arr = np.array([1,2,3,4,5,6,7,8,9,10])
first_three_elements = arr[:3]
print(first_three_elements)

[1 2 3]

Q5. Define 2 arrays arr1 and arr2 and compute the dot product

Q6. Compute the mean, median, and standard deviation of a given NumPy array arr.

Q7. Stack two given NumPy arrays arr1 and arr2 horizontally.

In [13]:
result = np.hstack((arr1, arr2))
print(result)

[1 2 3 4 5 6]

Q8. Perform matrix multiplication on two given NumPy arrays arr1 of shape (3, 2) and arr2 of shape (2, 3).

In [14]:
arr1 = np.array([[1, 2],[3, 4],[5, 6]])
arr2 = np.array([[7, 8, 9],[10, 11, 12]])
result = np.dot(arr1, arr2)
print(result)

[[ 27  30  33]
 [ 61  68  75]
 [ 95 106 117]]

Q9. Given a NumPy array arr, create a new array containing only the elements greater than 10.

Q10. Sort the elements of a given NumPy array arr in descending order.

Pandas Practice Questions

In [31]:
# Use the  dataframe below for all the panda questions

import pandas as pd
data = {
    'Name': ['John', 'Alice', 'Bob', 'Emily', 'David'],
    'Age': [25, 30, 35, 28, 40],
    'City': ['New York', 'Los Angeles', 'Chicago', 'San Francisco', 'Seattle'],
    'Salary': [50000, 60000, 70000, 55000, 80000]
}

df = pd.DataFrame(data)

Q1. Display the first 5 rows of the DataFrame.

In [25]:
df=pd.DataFrame(data)
print(df.head())

    name  age           city  salary
0   john   25        newyork   50000
1  alice   30     losangeles   60000
2    bob   35        chicago   70000
3  emily   28  san francisco   55000
4  david   40        seattle   80000

Q2. Access and print the 'Age' column of the DataFrame.

In [17]:
df = pd.DataFrame(data)
print(df.head())

   age
0   25
1   30
2   35
3   28
4   40

Q3. Sort the DataFrame based on the 'Salary' column in ascending order.

In [24]:
df=pd.DataFrame(data)
df_sorted = df.sort_values(by='salary')
print(df_sorted)

    name  age           city  salary
0   john   25        newyork   50000
3  emily   28  san francisco   55000
1  alice   30     losangeles   60000
2    bob   35        chicago   70000
4  david   40        seattle   80000

Q4. Calculate and display basic statistics (mean, median, min, max) for the 'Salary' column.

In [23]:
df=pd.DataFrame(data)
salary_stats = df['salary'].describe()
print(salary_stats[['mean','50%','min','max']])

mean    63000.0
50%     60000.0
min     50000.0
max     80000.0
Name: salary, dtype: float64

Q5. Filter the DataFrame to show only the rows where the 'Age' is greater than 30.

In [22]:
df=pd.DataFrame(data)
filtered_df = df[df['age']>30]
print(filtered_df)

    name  age     city  salary
2    bob   35  chicago   70000
4  david   40  seattle   80000

Q6. Add a new column 'Gender' to the DataFrame with values 'Male' for the first three rows and 'Female' for the last two rows.

In [21]:
df = pd.DataFrame(data)
df['Gender'] = ['Male', 'Male', 'Male', 'Female', 'Female']
print(df)

    name  age           city  salary  Gender
0   john   25        newyork   50000    Male
1  alice   30     losangeles   60000    Male
2    bob   35        chicago   70000    Male
3  emily   28  san francisco   55000  Female
4  david   40        seattle   80000  Female

Q7. Group the DataFrame by 'City' and calculate the average salary in each city.

In [34]:
df = pd.DataFrame(data)
average_salary_by_city = df.groupby('City')['Salary'].mean()
print(average_salary_by_city)

City
Chicago          70000.0
Los Angeles      60000.0
New York         50000.0
San Francisco    55000.0
Seattle          80000.0
Name: Salary, dtype: float64

Q8. Update the 'Salary' of the person named 'Bob' to 72000.

In [38]:
import pandas as pd
data = {'name':['john','alice','bob','emily','david'],
        'age':[25,30,35,28,40],
        'city':['newyork','losangeles','chicago','san francisco','seattle'],
        'salary':[50000,60000,70000,55000,80000]}
df=pd.DataFrame(data)
df.loc[df['name']=='bob','salary']=72000
print(df)

    name  age           city  salary
0   john   25        newyork   50000
1  alice   30     losangeles   60000
2    bob   35        chicago   72000
3  emily   28  san francisco   55000
4  david   40        seattle   80000

Q9. Create a new DataFrame with additional information about the 'City' such as 'Population' and 'Area', then merge it with the existing DataFrame on the 'City' column.

In [36]:
import pandas as pd
data_existing = {'name':['john','alice','bob','emily','david'],
        'age':[25,30,35,28,40],
        'city':['newyork','losangeles','chicago','san francisco','seattle'],
        'salary':[50000,60000,70000,55000,80000]}
df_existing = pd.DataFrame(data_existing)
data_new = {'city':['newyork','losangeles','chicago','san francisco','seattle'],
        'population':[254697,254789,133687,15963,125489],'area':[548,254,657,654,125]}
df_new = pd.DataFrame(data_new)
merged_df = pd.merge(df_existing,df_new,on = 'city')
print(merged_df)

    name  age           city  salary  population  area
0   john   25        newyork   50000      254697   548
1  alice   30     losangeles   60000      254789   254
2    bob   35        chicago   70000      133687   657
3  emily   28  san francisco   55000       15963   654
4  david   40        seattle   80000      125489   125

Q10. Rename the 'Name' column of the DataFrame to 'Full Name' and display the updated DataFrame.

In [37]:
import pandas as pd
data_existing = {'name':['john','alice','bob','emily','david'],
        'age':[25,30,35,28,40],
        'city':['newyork','losangeles','chicago','san francisco','seattle'],
        'salary':[50000,60000,70000,55000,80000]}
df_existing = pd.DataFrame(data_existing)
df_existing = df_existing.rename(columns={'name':'full name'})
print(df_existing)

  full name  age           city  salary
0      john   25        newyork   50000
1     alice   30     losangeles   60000
2       bob   35        chicago   70000
3     emily   28  san francisco   55000
4     david   40        seattle   80000